export class angularInfo {
  constructor() {}
  array: Array<any> = [
    {
      title: "路由守卫",
      description:
        "目前该网站只是做了关于用户是否登录的权限控制，路由守卫即跳转路由前的权限控制"
    },
    {
      title: "浏览器CSS兼容前缀",
      description:
        "由于之前的浏览器各自的渲染机制，即对于一些标准的定义的不一致性的历史原因，一部分CSS样式在个别浏览器中渲染时，" +
        "需要加入独特的CSS样式前缀。对此大而全的angular框架，已经为我们准备好了相关的配置文件，我们只需要填写相关数据即可。"+
        "本网站目前是默认配置，即无视IE浏览器，且包容占据市场份额百分之零点五的前两个版本的浏览器"
    },
    {
      title: "浏览器CSS兼容前缀",
      description:
        "由于之前的浏览器各自的渲染机制，即对于一些标准的定义的不一致性的历史原因，一部分CSS样式在个别浏览器中渲染时，" +
        "需要加入独特的CSS样式前缀。对此大而全的angular框架，已经为我们准备好了相关的配置文件，我们只需要填写相关数据即可。"+
        "本网站目前是默认配置，即无视IE浏览器，且包容占据市场份额百分之零点五的前两个版本的浏览器"
    },
    {
      title: "浏览器CSS兼容前缀",
      description:
        "由于之前的浏览器各自的渲染机制，即对于一些标准的定义的不一致性的历史原因，一部分CSS样式在个别浏览器中渲染时，" +
        "需要加入独特的CSS样式前缀。对此大而全的angular框架，已经为我们准备好了相关的配置文件，我们只需要填写相关数据即可。"+
        "本网站目前是默认配置，即无视IE浏览器，且包容占据市场份额百分之零点五的前两个版本的浏览器"
    },
    {
      title: "浏览器CSS兼容前缀",
      description:
        "由于之前的浏览器各自的渲染机制，即对于一些标准的定义的不一致性的历史原因，一部分CSS样式在个别浏览器中渲染时，" +
        "需要加入独特的CSS样式前缀。对此大而全的angular框架，已经为我们准备好了相关的配置文件，我们只需要填写相关数据即可。"+
        "本网站目前是默认配置，即无视IE浏览器，且包容占据市场份额百分之零点五的前两个版本的浏览器"
    },
    {
      title: "浏览器CSS兼容前缀",
      description:
        "由于之前的浏览器各自的渲染机制，即对于一些标准的定义的不一致性的历史原因，一部分CSS样式在个别浏览器中渲染时，" +
        "需要加入独特的CSS样式前缀。对此大而全的angular框架，已经为我们准备好了相关的配置文件，我们只需要填写相关数据即可。"+
        "本网站目前是默认配置，即无视IE浏览器，且包容占据市场份额百分之零点五的前两个版本的浏览器"
    },
  ];
}
